// Задача 65: 
// Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
//  M = 1; N = 5 -> "1, 2, 3, 4, 5" 
//  M = 4; N = 8 -> "4, 6, 7, 8"

void SumNum(int m, int n)
{
    if (n > m) SumNum(m, n - 1);
    Console.Write($"{n} ");
    if (m > n) SumNum(m, n + 1);
}
SumNum(10,1);